# StructAnalyticalErrorProjection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AnalyticalModelFailures..::..StructAnalyticalErrorProjection Property
BuiltInFailures..::..AnalyticalModelFailures Class See Also
---
Can't project Analytical Model to Analytical Projection Surface
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StructAnalyticalErrorProjection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructAnalyticalErrorProjection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StructAnalyticalErrorProjection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace